{
  "scrapeId": "31c642c2-5446-40c5-bc43-3269438a4745",
  "sourceURL": "https://angular.dev/ecosystem/service-workers/devops",
  "statusCode": 200,
  "data": {
    "markdown": "Skip to main content\n\nmenu\n\nmenuDocs\n\n- Introduction\n\n  - [What is Angular?](https://angular.dev/overview)\n  - [Installation](https://angular.dev/installation)\n  - Essentials\n  - [Start coding! 🚀](https://angular.dev/tutorials/learn-angular)\n- In-depth Guides\n\n  - Signals\n  - Components\n  - Templates\n  - Directives\n  - Dependency Injection\n  - Routing\n  - Forms\n  - HTTP Client\n  - Server-side & hybrid-rendering\n  - Testing\n  - Internationalization\n  - Experimental features\n- Developer Tools\n\n  - Angular CLI\n  - Libraries\n  - [DevTools](https://angular.dev/tools/devtools)\n  - [Language Service](https://angular.dev/tools/language-service)\n- Best Practices\n\n  - [Style Guide](https://angular.dev/style-guide)\n  - [Security](https://angular.dev/best-practices/security)\n  - [Accessibility](https://angular.dev/best-practices/a11y)\n  - Performance\n  - [Keeping up-to-date](https://angular.dev/update)\n- Extended Ecosystem\n\n  - [NgModules](https://angular.dev/guide/ngmodules/overview)\n  - Animations\n  - Using RxJS with Angular\n  - Service Workers & PWAs\n  - [Web workers](https://angular.dev/ecosystem/web-workers)\n  - [Custom build pipeline](https://angular.dev/ecosystem/custom-build-pipeline)\n  - [Angular Fire](https://github.com/angular/angularfire#readme)\n  - [Google Maps](https://github.com/angular/components/tree/main/src/google-maps#readme)\n  - [Google Pay](https://github.com/google-pay/google-pay-button#angular)\n  - [YouTube player](https://github.com/angular/components/blob/main/src/youtube-player/README.md)\n  - [Angular CDK](https://material.angular.io/cdk/categories)\n  - [Angular Material](https://material.angular.io/)\n\n- arrow\\_backService Workers & PWAs\n  - [Overview](https://angular.dev/ecosystem/service-workers)\n  - [Getting started](https://angular.dev/ecosystem/service-workers/getting-started)\n  - [Configuration file](https://angular.dev/ecosystem/service-workers/config)\n  - [Communicating with the service worker](https://angular.dev/ecosystem/service-workers/communications)\n  - [Push notifications](https://angular.dev/ecosystem/service-workers/push-notifications)\n  - [Service worker devops](https://angular.dev/ecosystem/service-workers/devops)\n  - [App shell pattern](https://angular.dev/ecosystem/service-workers/app-shell)\n\nThis site uses cookies from Google to deliver its services and to analyze traffic.\n\n[Learn more](https://policies.google.com/technologies/cookies) Ok, Got it\n\nThis page is a reference for deploying and supporting production applications that use the Angular service worker.\nIt explains how the Angular service worker fits into the larger production environment, the service worker's behavior under various conditions, and available resources and fail-safes.\n\n## [Service worker and caching of application resources](https://angular.dev/ecosystem/service-workers/devops\\#service-worker-and-caching-of-application-resources)\n\nImagine the Angular service worker as a forward cache or a Content Delivery Network (CDN) edge that is installed in the end user's web browser.\nThe service worker responds to requests made by the Angular application for resources or data from a local cache, without needing to wait for the network.\nLike any cache, it has rules for how content is expired and updated.\n\n### [Application versions](https://angular.dev/ecosystem/service-workers/devops\\#application-versions)\n\nIn the context of an Angular service worker, a \"version\" is a collection of resources that represent a specific build of the Angular application.\nWhenever a new build of the application is deployed, the service worker treats that build as a new version of the application.\nThis is true even if only a single file is updated.\nAt any given time, the service worker might have multiple versions of the application in its cache and it might be serving them simultaneously.\nFor more information, see the [Application tabs](https://angular.dev/ecosystem/service-workers/devops#application-tabs) section.\n\nTo preserve application integrity, the Angular service worker groups all files into a version together.\nThe files grouped into a version usually include HTML, JS, and CSS files.\nGrouping of these files is essential for integrity because HTML, JS, and CSS files frequently refer to each other and depend on specific content.\nFor example, an `index.html` file might have a `<script>` tag that references `bundle.js` and it might attempt to call a function `startApp()` from within that script.\nAny time this version of `index.html` is served, the corresponding `bundle.js` must be served with it.\nFor example, assume that the `startApp()` function is renamed to `runApp()` in both files.\nIn this scenario, it is not valid to serve the old `index.html`, which calls `startApp()`, along with the new bundle, which defines `runApp()`.\n\nThis file integrity is especially important when lazy loading.\nA JS bundle might reference many lazy chunks, and the filenames of the lazy chunks are unique to the particular build of the application.\nIf a running application at version `X` attempts to load a lazy chunk, but the server has already updated to version `X + 1`, the lazy loading operation fails.\n\nThe version identifier of the application is determined by the contents of all resources, and it changes if any of them change.\nIn practice, the version is determined by the contents of the `ngsw.json` file, which includes hashes for all known content.\nIf any of the cached files change, the file's hash changes in `ngsw.json`. This change causes the Angular service worker to treat the active set of files as a new version.\n\n**HELPFUL:** The build process creates the manifest file, `ngsw.json`, using information from `ngsw-config.json`.\n\nWith the versioning behavior of the Angular service worker, an application server can ensure that the Angular application always has a consistent set of files.\n\n#### [Update checks](https://angular.dev/ecosystem/service-workers/devops\\#update-checks)\n\nEvery time the user opens or refreshes the application, the Angular service worker checks for updates to the application by looking for updates to the `ngsw.json` manifest.\nIf an update is found, it is downloaded and cached automatically, and is served the next time the application is loaded.\n\n### [Resource integrity](https://angular.dev/ecosystem/service-workers/devops\\#resource-integrity)\n\nOne of the potential side effects of long caching is inadvertently caching a resource that's not valid.\nIn a normal HTTP cache, a hard refresh or the cache expiring limits the negative effects of caching a file that's not valid.\nA service worker ignores such constraints and effectively long-caches the entire application.\nIt's important that the service worker gets the correct content, so it keeps hashes of the resources to maintain their integrity.\n\n#### [Hashed content](https://angular.dev/ecosystem/service-workers/devops\\#hashed-content)\n\nTo ensure resource integrity, the Angular service worker validates the hashes of all resources for which it has a hash.\nFor an application created with the [Angular CLI](https://angular.dev/ecosystem/service-workers/tools/cli), this is everything in the `dist` directory covered by the user's `src/ngsw-config.json` configuration.\n\nIf a particular file fails validation, the Angular service worker attempts to re-fetch the content using a \"cache-busting\" URL parameter to prevent browser or intermediate caching.\nIf that content also fails validation, the service worker considers the entire version of the application to not be valid and stops serving the application.\nIf necessary, the service worker enters a safe mode where requests fall back on the network. The service worker doesn't use its cache if there's a high risk of serving content that is broken, outdated, or not valid.\n\nHash mismatches can occur for a variety of reasons:\n\n- Caching layers between the origin server and the end user could serve stale content\n- A non-atomic deployment could result in the Angular service worker having visibility of partially updated content\n- Errors during the build process could result in updated resources without `ngsw.json` being updated.\nThe reverse could also happen resulting in an updated `ngsw.json` without updated resources.\n\n#### [Unhashed content](https://angular.dev/ecosystem/service-workers/devops\\#unhashed-content)\n\nThe only resources that have hashes in the `ngsw.json` manifest are resources that were present in the `dist` directory at the time the manifest was built.\nOther resources, especially those loaded from CDNs, have content that is unknown at build time or are updated more frequently than the application is deployed.\n\nIf the Angular service worker does not have a hash to verify a resource is valid, it still caches its contents. At the same time, it honors the HTTP caching headers by using a policy of _stale while revalidate_.\nThe Angular service worker continues to serve a resource even after its HTTP caching headers indicate\nthat it is no longer valid. At the same time, it attempts to refresh the expired resource in the background.\nThis way, broken unhashed resources do not remain in the cache beyond their configured lifetimes.\n\n### [Application tabs](https://angular.dev/ecosystem/service-workers/devops\\#application-tabs)\n\nIt can be problematic for an application if the version of resources it's receiving changes suddenly or without warning.\nSee the [Application versions](https://angular.dev/ecosystem/service-workers/devops#application-versions) section for a description of such issues.\n\nThe Angular service worker provides a guarantee: a running application continues to run the same version of the application.\nIf another instance of the application is opened in a new web browser tab, then the most current version of the application is served.\nAs a result, that new tab can be running a different version of the application than the original tab.\n\n**IMPORTANT:** This guarantee is **stronger** than that provided by the normal web deployment model. Without a service worker, there is no guarantee that lazily loaded code is from the same version as the application's initial code.\n\nThe Angular service worker might change the version of a running application under error conditions such as:\n\n- The current version becomes non-valid due to a failed hash.\n- An unrelated error causes the service worker to enter safe mode and deactivates it temporarily.\n\nThe Angular service worker cleans up application versions when no tab is using them.\n\nOther reasons the Angular service worker might change the version of a running application are normal events:\n\n- The page is reloaded/refreshed.\n- The page requests an update be immediately activated using the `SwUpdate` service.\n\n### [Service worker updates](https://angular.dev/ecosystem/service-workers/devops\\#service-worker-updates)\n\nThe Angular service worker is a small script that runs in web browsers.\nFrom time to time, the service worker is updated with bug fixes and feature improvements.\n\nThe Angular service worker is downloaded when the application is first opened and when the application is accessed after a period of inactivity.\nIf the service worker changes, it's updated in the background.\n\nMost updates to the Angular service worker are transparent to the application. The old caches are still valid and content is still served normally.\nOccasionally, a bug fix or feature in the Angular service worker might require the invalidation of old caches.\nIn this case, the service worker transparently refreshes the application from the network.\n\n### [Bypassing the service worker](https://angular.dev/ecosystem/service-workers/devops\\#bypassing-the-service-worker)\n\nIn some cases, you might want to bypass the service worker entirely and let the browser handle the request.\nAn example is when you rely on a feature that is currently not supported in service workers, such as [reporting progress on uploaded files](https://github.com/w3c/ServiceWorker/issues/1141).\n\nTo bypass the service worker, set `ngsw-bypass` as a request header, or as a query parameter.\nThe value of the header or query parameter is ignored and can be empty or omitted.\n\n### [Service worker requests when the server can't be reached](https://angular.dev/ecosystem/service-workers/devops\\#service-worker-requests-when-the-server-cant-be-reached)\n\nThe service worker processes all requests unless the [service worker is explicitly bypassed](https://angular.dev/ecosystem/service-workers/devops#bypassing-the-service-worker).\nThe service worker either returns a cached response or sends the request to the server, depending on the state and configuration of the cache.\nThe service worker only caches responses to non-mutating requests, such as `GET` and `HEAD`.\n\nIf the service worker receives an error from the server or it doesn't receive a response, it returns an error status that indicates the result of the call.\nFor example, if the service worker doesn't receive a response, it creates a [504 Gateway Timeout](https://developer.mozilla.org/docs/Web/HTTP/Status/504) status to return. The `504` status in this example could be returned because the server is offline or the client is disconnected.\n\n## [Debugging the Angular service worker](https://angular.dev/ecosystem/service-workers/devops\\#debugging-the-angular-service-worker)\n\nOccasionally, it might be necessary to examine the Angular service worker in a running state to investigate issues or whether it's operating as designed.\nBrowsers provide built-in tools for debugging service workers and the Angular service worker itself includes useful debugging features.\n\n### [Locating and analyzing debugging information](https://angular.dev/ecosystem/service-workers/devops\\#locating-and-analyzing-debugging-information)\n\nThe Angular service worker exposes debugging information under the `ngsw/` virtual directory.\nCurrently, the single exposed URL is `ngsw/state`.\nHere is an example of this debug page's contents:\n\n```\n      NGSW Debug Info:Driver version: 13.3.7Driver state: NORMAL ((nominal))Latest manifest hash: eea7f5f464f90789b621170af5a569d6be077e5cLast update check: never=== Version eea7f5f464f90789b621170af5a569d6be077e5c ===Clients: 7b79a015-69af-4d3d-9ae6-95ba90c79486, 5bc08295-aaf2-42f3-a4cc-9e4ef9100f65=== Idle Task Queue ===Last update tick: 1s496uLast update run: neverTask queue: * init post-load (update, cleanup)Debug log:\n\n```\n\ncheck\n\n#### [Driver state](https://angular.dev/ecosystem/service-workers/devops\\#driver-state)\n\nThe first line indicates the driver state:\n\n```\n      Driver state: NORMAL ((nominal))\n\n```\n\ncheck\n\n`NORMAL` indicates that the service worker is operating normally and is not in a degraded state.\n\nThere are two possible degraded states:\n\n| Degraded states | Details |\n| :-- | :-- |\n| `EXISTING_CLIENTS_ONLY` | The service worker does not have a clean copy of the latest known version of the application. Older cached versions are safe to use, so existing tabs continue to run from cache, but new loads of the application will be served from the network. The service worker will try to recover from this state when a new version of the application is detected and installed. This happens when a new `ngsw.json` is available. |\n| `SAFE_MODE` | The service worker cannot guarantee the safety of using cached data. Either an unexpected error occurred or all cached versions are invalid. All traffic will be served from the network, running as little service worker code as possible. |\n\nIn both cases, the parenthetical annotation provides the\nerror that caused the service worker to enter the degraded state.\n\nBoth states are temporary; they are saved only for the lifetime of the [ServiceWorker instance](https://developer.mozilla.org/docs/Web/API/ServiceWorkerGlobalScope).\nThe browser sometimes terminates an idle service worker to conserve memory and processor power, and creates a new service worker instance in response to network events.\nThe new instance starts in the `NORMAL` mode, regardless of the state of the previous instance.\n\n#### [Latest manifest hash](https://angular.dev/ecosystem/service-workers/devops\\#latest-manifest-hash)\n\n```\n      Latest manifest hash: eea7f5f464f90789b621170af5a569d6be077e5c\n\n```\n\ncheck\n\nThis is the SHA1 hash of the most up-to-date version of the application that the service worker knows about.\n\n#### [Last update check](https://angular.dev/ecosystem/service-workers/devops\\#last-update-check)\n\n```\n      Last update check: never\n\n```\n\ncheck\n\nThis indicates the last time the service worker checked for a new version, or update, of the application.\n`never` indicates that the service worker has never checked for an update.\n\nIn this example debug file, the update check is currently scheduled, as explained the next section.\n\n#### [Version](https://angular.dev/ecosystem/service-workers/devops\\#version)\n\n```\n      === Version eea7f5f464f90789b621170af5a569d6be077e5c ===Clients: 7b79a015-69af-4d3d-9ae6-95ba90c79486, 5bc08295-aaf2-42f3-a4cc-9e4ef9100f65\n\n```\n\ncheck\n\nIn this example, the service worker has one version of the application cached and being used to serve two different tabs.\n\n**HELPFUL:** This version hash is the \"latest manifest hash\" listed above. Both clients are on the latest version. Each client is listed by its ID from the `Clients` API in the browser.\n\n#### [Idle task queue](https://angular.dev/ecosystem/service-workers/devops\\#idle-task-queue)\n\n```\n      === Idle Task Queue ===Last update tick: 1s496uLast update run: neverTask queue: * init post-load (update, cleanup)\n\n```\n\ncheck\n\nThe Idle Task Queue is the queue of all pending tasks that happen in the background in the service worker.\nIf there are any tasks in the queue, they are listed with a description.\nIn this example, the service worker has one such task scheduled, a post-initialization operation involving an update check and cleanup of stale caches.\n\nThe last update tick/run counters give the time since specific events happened related to the idle queue.\nThe \"Last update run\" counter shows the last time idle tasks were actually executed.\n\"Last update tick\" shows the time since the last event after which the queue might be processed.\n\n#### [Debug log](https://angular.dev/ecosystem/service-workers/devops\\#debug-log)\n\n```\n      Debug log:\n\n```\n\ncheck\n\nErrors that occur within the service worker are logged here.\n\n### [Developer tools](https://angular.dev/ecosystem/service-workers/devops\\#developer-tools)\n\nBrowsers such as Chrome provide developer tools for interacting with service workers.\nSuch tools can be powerful when used properly, but there are a few things to keep in mind.\n\n- When using developer tools, the service worker is kept running in the background and never restarts.\nThis can cause behavior with Dev Tools open to differ from behavior a user might experience.\n\n- If you look in the Cache Storage viewer, the cache is frequently out of date.\nRight-click the Cache Storage title and refresh the caches.\n\n- Stopping and starting the service worker in the Service Worker pane checks for updates\n\n\n## [Service worker safety](https://angular.dev/ecosystem/service-workers/devops\\#service-worker-safety)\n\nBugs or broken configurations could cause the Angular service worker to act in unexpected ways.\nIf this happens, the Angular service worker contains several failsafe mechanisms in case an administrator needs to deactivate the service worker quickly.\n\n### [Fail-safe](https://angular.dev/ecosystem/service-workers/devops\\#fail-safe)\n\nTo deactivate the service worker, rename the `ngsw.json` file or delete it.\nWhen the service worker's request for `ngsw.json` returns a `404`, then the service worker removes all its caches and de-registers itself, essentially self-destructing.\n\n### [Safety worker](https://angular.dev/ecosystem/service-workers/devops\\#safety-worker)\n\nA small script, `safety-worker.js`, is also included in the `@angular/service-worker` NPM package.\nWhen loaded, it un-registers itself from the browser and removes the service worker caches.\nThis script can be used as a last resort to get rid of unwanted service workers already installed on client pages.\n\n**CRITICAL:** You cannot register this worker directly, as old clients with cached state might not see a new `index.html` which installs the different worker script.\n\nInstead, you must serve the contents of `safety-worker.js` at the URL of the Service Worker script you are trying to unregister. You must continue to do so until you are certain all users have successfully unregistered the old worker.\nFor most sites, this means that you should serve the safety worker at the old Service Worker URL forever.\nThis script can be used to deactivate `@angular/service-worker` and remove the corresponding caches. It also removes any other Service Workers which might have been served in the past on your site.\n\n### [Changing your application's location](https://angular.dev/ecosystem/service-workers/devops\\#changing-your-applications-location)\n\n**IMPORTANT:** Service workers don't work behind redirect.\nYou might have already encountered the error `The script resource is behind a redirect, which is disallowed`.\n\nThis can be a problem if you have to change your application's location.\nIf you set up a redirect from the old location, such as `example.com`, to the new location, `www.example.com` in this example, the worker stops working.\nAlso, the redirect won't even trigger for users who are loading the site entirely from Service Worker.\nThe old worker, which was registered at `example.com`, tries to update and sends a request to the old location `example.com`. This request is redirected to the new location `www.example.com` and creates the error: `The script resource is behind a redirect, which is disallowed`.\n\nTo remedy this, you might need to deactivate the old worker using one of the preceding techniques: [Fail-safe](https://angular.dev/ecosystem/service-workers/devops#fail-safe) or [Safety Worker](https://angular.dev/ecosystem/service-workers/devops#safety-worker).\n\n## [More on Angular service workers](https://angular.dev/ecosystem/service-workers/devops\\#more-on-angular-service-workers)\n\nYou might also be interested in the following:",
    "screenshot": "https://service.firecrawl.dev/storage/v1/object/public/media/screenshot-b22cdcfb-2c43-45cd-8050-a1661ec3ceca.png"
  },
  "metadata": {
    "twitter:image": "https://angular.dev/assets/images/ng-image.jpg",
    "application-name": "Angular",
    "og:description": "The web development framework for building modern apps.",
    "title": "Service worker devops • Angular",
    "twitter:card": "summary_large_image",
    "ogTitle": "Angular",
    "msapplication-TileColor": "#e90464",
    "ogDescription": "The web development framework for building modern apps.",
    "ogImage": "https://angular.dev/assets/images/ng-image.jpg",
    "favicon": "https://angular.dev/assets/icons/favicon-48x48.png",
    "apple-mobile-web-app-title": "Angular",
    "viewport": "width=device-width, initial-scale=1",
    "theme-color": "#ffffff",
    "description": "The web development framework for building modern apps.",
    "og:type": "website",
    "og:url": "https://angular.dev/",
    "language": "en",
    "og:title": "Angular",
    "og:image": "https://angular.dev/assets/images/ng-image.jpg",
    "twitter:url": "https://angular.dev/",
    "ogUrl": "https://angular.dev/",
    "twitter:description": "The web development framework for building modern apps.",
    "twitter:title": "Angular",
    "msapplication-config": "/assets/icons/browserconfig.xml",
    "scrapeId": "31c642c2-5446-40c5-bc43-3269438a4745",
    "sourceURL": "https://angular.dev/ecosystem/service-workers/devops",
    "url": "https://angular.dev/ecosystem/service-workers/devops",
    "statusCode": 200
  }
}